import { SectionWrapper } from "@/components/SectionWrapper";
import { TextField } from "@/components/TextField";
import { ReturnBtn } from "@/components/Buttons/ReturnBtn";
import styles from './Terms.module.css';

export const Terms = () => {
  return (
    <>
      <div className={styles.title}>
        <TextField variant="h2" color="main">
          Условия использования
        </TextField>
      </div>
      <SectionWrapper>
        <TextField variant="p" color="main">
          Настоящие условия использования применяются к приложению &rdquo;Мой дворецкий&rdquo; (далее – «Приложение») для мобильных устройств, созданному ИП Самойлов Никита Викторович (далее – «Поставщик услуг») в качестве коммерческой услуги.
          Устанавливая или используя Приложение, вы автоматически соглашаетесь со следующими условиями. Настоятельно рекомендуется внимательно ознакомиться с этими условиями перед использованием Приложения. Несанкционированное копирование, изменение Приложения, любой его части или наших товарных знаков строго запрещено. Любые попытки извлечь исходный код Приложения, перевести Приложение на другие языки или создать производные версии запрещены. Все товарные знаки, авторские права, права на базы данных и другие права интеллектуальной собственности, связанные с Приложением, остаются собственностью Поставщика услуг.
          Поставщик услуг стремится обеспечить максимальную эффективность и полезность Приложения. В связи с этим он оставляет за собой право вносить изменения в Приложение или взимать плату за свои услуги.
          Приложение хранит и обрабатывает персональные данные, которые вы предоставили Поставщику услуг для предоставления Услуги. Вы несете ответственность за обеспечение безопасности своего телефона и доступа к Приложению. Поставщик услуг настоятельно рекомендует не проводить джейлбрейк или рутирование телефона, что подразумевает снятие ограничений программного обеспечения и ограничений, налагаемых официальной операционной системой вашего устройства. Такие действия могут подвергнуть ваш телефон риску заражения вредоносными программами, вирусами, поставить под угрозу функции безопасности вашего телефона и привести к некорректной работе или полной неработоспособности Приложения.
          Обратите внимание, что Поставщик услуг не несет ответственности за определенные аспекты. Для некоторых функций Приложения требуется активное подключение к Интернету, которое может быть по Wi-Fi или предоставлено вашим оператором мобильной связи. Поставщик услуг не несет ответственности, если Приложение работает не на полную мощность из-за отсутствия доступа к Wi-Fi или исчерпания вашего лимита данных.
          Если вы используете приложение за пределами зоны действия Wi-Fi, учтите, что условия соглашения вашего оператора мобильной связи остаются в силе. Следовательно, ваш оператор мобильной связи может взимать с вас плату за использование данных во время подключения к приложению, а также другие сборы третьих лиц. Используя приложение, вы принимаете на себя ответственность за любые такие расходы, включая расходы на передачу данных в роуминге, если вы используете приложение за пределами вашей домашней территории (например, региона или страны) без отключения роуминга данных. Если вы не являетесь плательщиком счета за устройство, на котором вы используете приложение, предполагается, что вы получили разрешение плательщика.
          Точно так же, Поставщик услуг не всегда несет ответственность за использование вами приложения. Например, вы несете ответственность за поддержание заряда вашего устройства. Если ваше устройство разрядится, и вы не сможете получить доступ к Сервису, Поставщик услуг не несет ответственности.
          Поставщик услуг не несет ответственности за любые убытки, прямые или косвенные, которые вы можете понести в результате использования Приложения, ровно как и за бесперебойную работоспособность Приложения из-за сбоев и приостановки сервера, на котором Приложение работает. Поставщик обязуется в минимально возможные сроки устранять сбои сервера или возобновить работу сервера своими или привлеченными силами.
          Часть контента генерируется нейросетью (DeepSeek Assistant). Поставщик услуг не несет какой-либо ответственности за возможный ущерб при использовании данного контента. Подобный контент предоставляется исключительно в ознакомительных целях.
          Тарифы за использование Приложения устанавливаются Поставщиком услуг и доступны для ознакомления на веб-сайте https://дворецкий.site и в Приложении. Поставщик услуг в праве в любой момент изменить стоимость тарифов, без уведомления какой-либо из сторон. Подключенный тариф действует 30 дней с момента его оплаты. По истечении 30 дней с момента оплаты и подключения тарифа действие тарифа и доступ в Приложение прекращаются, при этом, раздел с тарифами для ознакомления и оплаты остается доступен. Для дальнейшего использования Приложения необходимо оплатить тариф. После оплаты тарифа его подключение происходит автоматически. Сроки подключения зависят от скорости интернет-соединения и не зависят от Поставщика услуг. Частота использования Приложения в днях остается на ваше усмотрение. При этом, ранее оплаченный и подключенный тариф не перестает свое действие, если 30 дней с момента оплаты и подключения не истекли. Стоимость тарифа не пересчитывается пропорционально не используемому количество времени, в днях.
          Поставщик услуг не гарантирует, что он всегда будет обновлять приложение таким образом, чтобы оно соответствовало вашим потребностям и/или было совместимо с конкретной версией операционной системы или браузером, установленными на вашем устройстве. Вы соглашаетесь с тем, что Поставщик услуг в любое время может обновить приложение и эти обновления автоматически отобразятся в вашем Приложении при его запуске. Поставщик услуг также может прекратить предоставление приложения и его использование в любое время без уведомления вас об этом. Если иное не будет указано в соглашении, то после расторжения соглашения (а) права и лицензии, предоставленные вам настоящими условиями, прекращаются; (б) вы должны прекратить использование приложения и (при необходимости) удалить его со своего устройства.
        </TextField>
        <TextField variant="p" color="main" style={{ marginTop: '15px' }}>
          Контакты и реквизиты:
        </TextField>
        <TextField variant="p" color="main">
          email: nsam7655@gmail.com
        </TextField>
        <TextField variant="p" color="main">
          ИП Самойлов Никита Викторович
        </TextField>
        <TextField variant="p" color="main">
          ИНН: 563301125949
        </TextField>
        <TextField variant="p" color="main">
          ОГРНИП: 324565800113144
        </TextField>
        <div className={styles.returnBtn}>
          <ReturnBtn />
        </div>
      </SectionWrapper>
    </>
  )
};