const lifeHacksContent = [
  {
    title: '1. Замена соли лимоном',
    paragraph: 'Шефы используют лимонный сок вместо соли в салатах, маринадах для рыбы и морепродуктов. Это усиливает вкус без пересоленности',
  },
  {
    title: '2. Спасение пересоленного суп',
    paragraph: 'Поместите рис или другую крупу в марлю, опустите в суп и проварите 20 минут. Крупа впитает лишнюю соль',
  },
  {
    title: '3. Идеальный прозрачный бульон',
    paragraph: 'Добавьте кубик льда при варке — жир и примеси соберутся на поверхности, и бульон станет чище ',
  },
  {
    title: '4. Обжарка чеснока для аромата',
    paragraph: 'Перед жаркой картофеля или мяса обжарьте в масле 1-2 зубчика чеснока. Это придаст блюду глубину вкуса',
  },
  {
    title: '5. Заморозка зелени в масле',
    paragraph: 'Нарежьте свежую зелень, разложите по формочкам для льда, залейте оливковым маслом и заморозьте. Готовые кубики добавляйте в супы и соусы',
  },
  {
    title: '6. Легкая очистка яиц',
    paragraph: 'Добавьте 1 ст. л. уксуса в воду при варке — скорлупа не прилипнет к белку',
  },
  {
    title: '8. Хранение сыра и колбасы',
    paragraph: 'Смажьте срезы сливочным или растительным маслом — продукты не засохнут',
  },
  {
    title: '9. Использование рассола от огурцов',
    paragraph: 'Маринуйте в нем морковь, цветную капусту или лук — получите пикантную закуску',
  },
  {
    title: '10. «Реанимация» вялого сельдерея',
    paragraph: 'Обрежьте кончики стеблей и поставьте в стакан с ледяной водой на 1 час — они снова станут хрустящими',
  },
];

const lifeHacksBonus = [
  {
    title: '- Для идеальной пасты — добавляйте пармезан в горячую пасту до соуса, чтобы он лучше прилипал.',
  },
  {
    title: '- Острота без перца — используйте калабрийские чили для дымного аромата в соусах.',
  }
];

export const textsConfig = {
  lifeHacksContent,
  lifeHacksBonus,
};